In [28]:

# If we want to check the relationship between categorial variable 
# with repect to output variable then go with Chi-Square Test.

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
import warnings
warnings.filterwarnings('ignore')

In [29]:
data = sns.load_dataset('titanic')
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
data.duplicated().sum()

107

In [31]:
data.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [33]:
data['sex']=np.where(data['sex']=="male" ,1,0)

# Perform label encoding on embarked

ordinal_label={k : i for i , k in enumerate(data['embarked'].unique(),0)}
ordinal_label

{'S': 0, 'C': 1, 'Q': 2, nan: 3}

In [34]:
data['embarked']=data['embarked'].map(ordinal_label)

In [35]:
data['alone']=np.where(data['alone']==True,1,0)
data = data[['sex','embarked','alone','pclass','survived']]
data.head()

   sex  embarked  alone  pclass  survived
0    1         0      0       3         0
1    0         1      0       1         1
2    0         0      1       3         1
3    0         0      0       1         1
4    1         0      1       3         0

In [36]:
from sklearn.model_selection import train_test_split
X=data.drop(columns=['survived'])
y=data[['survived']]
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.20,random_state=1)

### Perform Chi-Square test

In [37]:
from sklearn.feature_selection import chi2

f_p_values=chi2(X_train,y_train)
f_p_values

# First values if F-score and second is p-value 
# F-score should be high and p-value should be less.

(array([74.3000848 , 12.6031116 , 15.14726188, 27.47313148]),
 array([6.71006281e-18, 3.85105120e-04, 9.94424223e-05, 1.59292189e-07]))

In [42]:
# Sort the p-values

p_values=pd.Series(f_p_values[1])
p_values.index=X_train.columns
p_values.sort_index(ascending=False)

sex         6.710063e-18
pclass      1.592922e-07
embarked    3.851051e-04
alone       9.944242e-05
dtype: float64

### THE END